---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.PointIterator.MoveNext
source: html/17ee05f2-276a-ba76-d043-17acf058551f.htm
---
# Autodesk.Revit.DB.PointClouds.PointIterator.MoveNext Method

Increments the iterator to the next point in the collection.

## Syntax (C#)
```csharp
public virtual bool MoveNext()
```

## Returns
True if there is another available point in this iterator.
 False if the iterator has completed all available points.